In [1]:
import numpy as np
import pandas as pd

# DataFrame Functionality: Basic operations and manipulation

In [2]:
titanic = pd.read_csv('../datasets/titanic/titanic.csv')

In [3]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Inspecting the DataFrame

In [4]:
len(titanic)

1310

In [5]:
# Number of rows and columns in the DataFrane
titanic.shape

(1310, 14)

In [6]:
titanic.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
titanic.tail(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.225,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.875,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
for x in titanic.index[30:60]:
    print x

30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59

In [11]:
#titanic.drop(titanic.index[30:60], axis=0).tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1300,3.0,1.0,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1.0,0.0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3.0,0.0,"Yousif, Mr. Wazli",male,NaN,0.0,0.0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3.0,0.0,"Yousseff, Mr. Gerious",male,NaN,0.0,0.0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN

In [8]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
pclass       1309 non-null float64
survived     1309 non-null float64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null float64
parch        1309 non-null float64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

## Common operations

In [15]:
titanic.columns

Index([u'pclass', u'survived', u'name', u'sex', u'age', u'sibsp', u'parch',
       u'ticket', u'fare', u'cabin', u'embarked', u'boat', u'body',
       u'home.dest'],
      dtype='object')

**In the following operations we apply the .head(3) method just for convinience, so we can see only a few rows of the output.**

In [21]:
# Selecting rows where embarked in not null
titanic[titanic['embarked'].notnull()].head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [22]:
# Selecting rows where embarked is not null and passangers in the first class
titanic[titanic['embarked'].notnull() & (titanic['pclass']==1)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1.0,0.0,"Astor, Col. John Jacob",male,47.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1.0,1.0,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1.0,0.0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1.0,1.0,"Aubart, Mme. Leontine Pauline",female,24.0000,0.0,0.0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1.0,1.0,"Barber, Miss. Ellen ""Nellie""",female,26.0000,0.0,0.0,19877,78.8500,NaN,S,6,NaN,NaN
14,1.0,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0.0,0.0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1.0,0.0,"Baumann, Mr. John D",male,NaN,0.0,0.0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1.0,0.0,"Baxter, Mr. Quigg Edmond",male,24.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1.0,1.0,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0.0,1.0,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1.0,1.0,"Bazzani, Miss. Albina",female,32.0000,0.0,0.0,11813,76.2917,D15,C,8,NaN,NaN
19,1.0,0.0,"Beattie, Mr. Thomson",male,36.0000,0.0,0.0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"
20,1.0,1.0,"Beckwith, Mr. Richard Leonard",male,37.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
21,1.0,1.0,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0000,1.0,1.0,11751,52.5542,D35,S,5,NaN,"New York, NY"
22,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0000,0.0,0.0,111369,30.0000,C148,C,5,NaN,"New York, NY"
23,1.0,1.0,"Bidois, Miss. Rosalie",female,42.0000,0.0,0.0,PC 17757,227.5250,NaN,C,4,NaN,NaN
24,1.0,1.0,"Bird, Miss. Ellen",female,29.0000,0.0,0.0,PC 17483,221.7792,C97,S,8,NaN,NaN
25,1.0,0.0,"Birnbaum, Mr. Jakob",male,25.0000,0.0,0.0,13905,26.0000,NaN,C,NaN,148.0,"San Francisco, CA"
26,1.0,1.0,"Bishop, Mr. Dickinson H",male,25.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
27,1.0,1.0,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0000,1.0,0.0,11967,91.0792,B49,C,7,NaN,"Dowagiac, MI"
28,1.0,1.0,"Bissette, Miss. Amelia",female,35.0000,0.0,0.0,PC 17760,135.6333,C99,S,8,NaN,NaN
29,1.0,1.0,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.0000,0.0,0.0,110564,26.5500,C52,S,D,NaN,"Stockholm, Sweden / Washington, DC"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
293,1.0,1.0,"Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)",female,NaN,1.0,0.0,19996,52.0000,C126,S,5 7,NaN,"London / East Orange, NJ"
294,1.0,0.0,"Thayer, Mr. John Borland",male,49.0000,1.0,1.0,17421,110.8833,C68,C,NaN,NaN,"Haverford, PA"
295,1.0,1.0,"Thayer, Mr. John Borland Jr",male,17.0000,0.0,2.0,17421,110.8833,C70,C,B,NaN,"Haverford, PA"
296,1.0,1.0,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0000,1.0,1.0,17421,110.8833,C68,C,4,NaN,"Haverford, PA"
297,1.0,1.0,"Thorne, Mrs. Gertrude Maybelle",female,NaN,0.0,0.0,PC 17585,79.2000,NaN,C,D,NaN,"New York, NY"
298,1.0,1.0,"Tucker, Mr. Gilbert Milligan Jr",male,31.0000,0.0,0.0,2543,28.5375,C53,C,7,NaN,"Albany, NY"
299,1.0,0.0,"Uruchurtu, Don. Manuel E",male,40.0000,0.0,0.0,PC 17601,27.7208,NaN,C,NaN,NaN,"Mexico City, Mexico"
300,1.0,0.0,"Van der hoef, Mr. Wyckoff",male,61.0000,0.0,0.0,111240,33.5000,B19,S,NaN,245.0,"Brooklyn, NY"
301,1.0,0.0,"Walker, Mr. William Anderson",male,47.0000,0.0,0.0,36967,34.0208,D46,S,NaN,NaN,"East Orange, NJ"
302,1.0,1.0,"Ward, Miss. Anna",female,35.0000,0.0,0.0,PC 17755,512.3292,NaN,C,3,NaN,NaN
303,1.0,0.0,"Warren, Mr. Frank Manley",male,64.0000,1.0,0.0,110813,75.2500,D37,C,NaN,NaN,"Portland, OR"
304,1.0,1.0,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0000,1.0,0.0,110813,75.2500,D37,C,5,NaN,"Portland, OR"
305,1.0,0.0,"Weir, Col. John",male,60.0000,0.0,0.0,113800,26.5500,NaN,S,NaN,NaN,"England Salt Lake City, Utah"
306,1.0,0.0,"White, Mr. Percival Wayland",male,54.0000,0.0,1.0,35281,77.2875,D26,S,NaN,NaN,"Brunswick, ME"
307,1.0,0.0,"White, Mr. Richard Frasar",male,21.0000,0.0,1.0,35281,77.2875,D26,S,NaN,169.0,"Brunswick, ME"
308,1.0,1.0,"White, Mrs. John Stuart (Ella Holmes)",female,55.0000,0.0,0.0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Briarcliff Manor NY"
309,1.0,1.0,"Wick, Miss. Mary Natalie",female,31.0000,0.0,2.0,36928,164.8667,C7,S,8,NaN,"Youngstown, OH"
310,1.0,0.0,"Wick, Mr. George Dennick",male,57.0000,1.0,1.0,36928,164.8667,NaN,S,NaN,NaN,"Youngstown, OH"
311,1.0,1.0,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0000,1.0,1.0,36928,164.8667,NaN,S,8,NaN,"Youngstown, OH"
312,1.0,0.0,"Widener, Mr. George Dunton",male,50.0000,1.0,1.0,113503,211.5000,C80,C,NaN,NaN,"Elkins Park, PA"
313,1.0,0.0,"Widener, Mr. Harry Elkins",male,27.0000,0.0,2.0,113503,211.5000,C82,C,NaN,NaN,"Elkins Park, PA"
314,1.0,1.0,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0000,1.0,1.0,113503,211.5000,C80,C,4,NaN,"Elkins Park, PA"
315,1.0,1.0,"Willard, Miss. Constance",female,21.0000,0.0,0.0,113795,26.5500,NaN,S,8 10,NaN,"Duluth, MN"
316,1.0,0.0,"Williams, Mr. Charles Duane",male,51.0000,0.0,1.0,PC 17597,61.3792,NaN,C,NaN,NaN,"Geneva, Switzerland / Radnor, PA"
317,1.0,1.0,"Williams, Mr. Richard Norris II",male,21.0000,0.0,1.0,PC 17597,61.3792,NaN,C,A,NaN,"Geneva, Switzerland / Radnor, PA"
318,1.0,0.0,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0.0,0.0,113510,35.0000,C128,S,NaN,NaN,"London, England"
319,1.0,1.0,"Wilson, Miss. Helen Alice",female,31.0000,0.0,0.0,16966,134.5000,E39 E41,C,3,NaN,NaN
320,1.0,1.0,"Woolner, Mr. Hugh",male,NaN,0.0,0.0,19947,35.5000,C52,S,D,NaN,"London, England"
321,1.0,0.0,"Wright, Mr. George",male,62.0000,0.0,0.0,113807,26.5500,NaN,S,NaN,NaN,"Halifax, NS"
322,1.0,1.0,"Young, Miss. Marie Grice",female,36.0000,0.0,0.0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Washington, DC"

In [24]:
# Sorting values by fare 
titanic.sort_values(by='fare', ascending=False).head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
183,1.0,1.0,"Lesurer, Mr. Gustave J",male,35.0,0.0,0.0,PC 17755,512.3292,B101,C,3,NaN,NaN
302,1.0,1.0,"Ward, Miss. Anna",female,35.0,0.0,0.0,PC 17755,512.3292,NaN,C,3,NaN,NaN
49,1.0,1.0,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0.0,1.0,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA"

In [26]:
# Get the oldest and youngest passangers
titanic.sort_values(by='age', ascending=True).head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
763,3.0,1.0,"Dean, Miss. Elizabeth Gladys ""Millvina""",female,0.1667,1.0,2.0,C.A. 2315,20.5750,NaN,S,10,NaN,"Devon, England Wichita, KS"
747,3.0,0.0,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.3333,0.0,2.0,347080,14.4000,NaN,S,NaN,NaN,"Stanton, IA"
1240,3.0,1.0,"Thomas, Master. Assad Alexander",male,0.4167,0.0,1.0,2625,8.5167,NaN,C,16,NaN,NaN

In [34]:
#titanic.set_index('home.dest')

In [35]:
# Setting a column as an index
titanic.set_index('name', inplace=True)
titanic.head(3)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1.0,1.0,female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1.0,1.0,male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1.0,0.0,female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [36]:
titanic.loc['Allison, Miss. Helen Loraine']

pclass                                     1
survived                                   0
sex                                   female
age                                        2
sibsp                                      1
parch                                      2
ticket                                113781
fare                                  151.55
cabin                                C22 C26
embarked                                   S
boat                                     NaN
body                                     NaN
home.dest    Montreal, PQ / Chesterville, ON
Name: Allison, Miss. Helen Loraine, dtype: object

In [39]:
# Assing the value 13 to the boat of 'Allison, Miss. Helen Loraine'
titanic.loc['Allison, Miss. Helen Loraine','boat'] = 13

#### Deleting rows and colums

In [40]:
titanic.reset_index(inplace=True)
titanic.head(5)

,name,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,"Allen, Miss. Elisabeth Walton",1.0,1.0,female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,"Allison, Master. Hudson Trevor",1.0,1.0,male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",1.0,0.0,female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,13,NaN,"Montreal, PQ / Chesterville, ON"
3,"Allison, Mr. Hudson Joshua Creighton",1.0,0.0,male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1.0,0.0,female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
titanic.drop(1309, axis=0, inplace=True)
titanic.tail(3)

In [41]:
titanic.drop('body', axis=1, inplace=True)
titanic.tail(3)

,name,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
1307,"Zakarian, Mr. Ortin",3.0,0.0,male,27.0,0.0,0.0,2670,7.225,NaN,C,NaN,NaN
1308,"Zimmerman, Mr. Leo",3.0,0.0,male,29.0,0.0,0.0,315082,7.875,NaN,S,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [45]:
titanic.head(3)

,name,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,"Allen, Miss. Elisabeth Walton",1.0,1.0,female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,"St Louis, MO"
1,"Allison, Master. Hudson Trevor",1.0,1.0,male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,"Montreal, PQ / Chesterville, ON"
2,"Allison, Miss. Helen Loraine",1.0,0.0,female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,13,"Montreal, PQ / Chesterville, ON"

In [42]:
titanic.loc[1,'name']

'Allison, Master. Hudson Trevor'

In [46]:
titanic.loc[1]['name']

name          Allison, Master. Hudson Trevor
pclass                                     1
survived                                   1
sex                                     male
age                                   0.9167
sibsp                                      1
parch                                      2
ticket                                113781
fare                                  151.55
cabin                                C22 C26
embarked                                   S
boat                                      11
home.dest    Montreal, PQ / Chesterville, ON
Name: 1, dtype: object

In [50]:
titanic.loc[[1,2,3,4],['pclass','age']]

   pclass      age
1     1.0   0.9167
2     1.0   2.0000
3     1.0  30.0000
4     1.0  25.0000

## Statistics with DataFrames

A large number of methods for computing descriptive statistics and other related operations on Series and DataFrames. Most of these are aggregations (hence producing a lower-dimensional result) like sum(), mean(), and quantile(), but some of them, like cumsum() and cumprod(), produce an object of the same size. Generally speaking, these methods take an axis argument, just like ndarray.{sum, std, ...}, but the axis can be specified by name or integer:

* Series: no axis argument needed
* DataFrame: index (axis=0, default), columns (axis=1) (**This can be potentially confusing!**)

Here is a quick reference summary table of common functions.

<table border="1" class="docutils">
<colgroup>
<col width="20%">
<col width="80%">
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Function</th>
<th class="head">Description</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">count</span></tt></td>
<td>Number of non-null observations</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">sum</span></tt></td>
<td>Sum of values</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">mean</span></tt></td>
<td>Mean of values</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">mad</span></tt></td>
<td>Mean absolute deviation</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">median</span></tt></td>
<td>Arithmetic median of values</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">min</span></tt></td>
<td>Minimum</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">max</span></tt></td>
<td>Maximum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">mode</span></tt></td>
<td>Mode</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">abs</span></tt></td>
<td>Absolute Value</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">prod</span></tt></td>
<td>Product of values</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">std</span></tt></td>
<td>Bessel-corrected sample standard deviation</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">var</span></tt></td>
<td>Unbiased variance</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">sem</span></tt></td>
<td>Standard error of the mean</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">skew</span></tt></td>
<td>Sample skewness (3rd moment)</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">kurt</span></tt></td>
<td>Sample kurtosis (4th moment)</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">quantile</span></tt></td>
<td>Sample quantile (value at %)</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">cumsum</span></tt></td>
<td>Cumulative sum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">cumprod</span></tt></td>
<td>Cumulative product</td>
</tr>
<tr class="row-even"><td><tt class="docutils literal"><span class="pre">cummax</span></tt></td>
<td>Cumulative maximum</td>
</tr>
<tr class="row-odd"><td><tt class="docutils literal"><span class="pre">cummin</span></tt></td>
<td>Cumulative minimum</td>
</tr>
</tbody>
</table>

In [51]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200

In [52]:
titanic_numerics = titanic[['age','sibsp', 'parch', 'fare']]

In [54]:
titanic_numerics.head()

       age  sibsp  parch      fare
0  29.0000    0.0    0.0  211.3375
1   0.9167    1.0    2.0  151.5500
2   2.0000    1.0    2.0  151.5500
3  30.0000    1.0    2.0  151.5500
4  25.0000    1.0    2.0  151.5500

In [56]:
titanic_numerics.mean()

age      29.881135
sibsp     0.498854
parch     0.385027
fare     33.295479
dtype: float64

In [57]:
titanic_numerics.max(axis=0)

age       80.0000
sibsp      8.0000
parch      9.0000
fare     512.3292
dtype: float64

The idxmin() and idxmax() functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values:

In [58]:
titanic_numerics.idxmax(axis=0)

age        14
sibsp    1170
parch    1179
fare       49
dtype: int64

In [ ]:
titanic_numerics.idxmin(axis=0)

In [63]:
titanic['age'].median()

28.0

### Counting values for categorical variables

In [69]:
titanic['embarked'].isnull().sum()

3

In [64]:
titanic['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [67]:
# Number of unique values
titanic['embarked'].nunique()

3

### Iteration

The behavior of basic iteration over pandas objects depends on the type. When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. Other data structures, like DataFrame and Panel, follow the dict-like convention of iterating over the keys of the objects.

In short, basic iteration (for i in object) produces:

* Series: values
* DataFrame: column labels

In [ ]:
titanic.reset_index(inplace=True)

In [ ]:
for name, survived in zip(titanic['name'][0:10], titanic['survived'][0:10]):
    text = " survided" if survived==0 else " did not survived"
    print name + text

### Go to Exercises